Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Vim stands for Vi IMproved. It used to be Vi IMitation, but there are so many improvements that a name change was appropriate. Vim is a text editor which includes almost all the commands from the Unix program "Vi" and a lot of new ones. It is very useful for editing programs and other plain text. All commands are given with the keyboard. This has the advantage that you can keep your fingers on the keyboard and your eyes on the screen. For those who want it, there is mouse support and a GUI version with scrollbars and menus (see |gui.txt|).
es_es: Vim son las siglas de Vi Improved («Vi mejorado»). Solía significar Vi IMitation, pero hay tantas mejoras que se consideró apropiado cambiar el nombre. Vim es un editor de texto que incluye casi todas las órdenes del programa para Unix, Vi, así como otras más. Es muy útil para la edición de programas y archivos de formato de texto normal. Todas las órdenes se introducen mediante el teclado. Ésto ofrece la ventaja de poder tener sus dedos en el teclado y sus ojos en la pantalla. Para aquellos que lo deseen, también tiene compatibilidad con ratón y una versión que ofrece una interfaz gráfica con barras de desplazamiento y menús (consulte |gui.txt|).

source: An overview of this manual can be found in the file "help.txt", |help.txt|. It can be accessed from within Vim with the <Help> or <F1> key and with the |:help| command (just type ":help", without the bars or quotes). The 'helpfile' option can be set to the name of the help file, in case it is not located in the default place. You can jump to subjects like with tags: Use CTRL-] to jump to a subject under the cursor, use CTRL-T to jump back.
es_es: Encontrará una visión general de este manual en el archivo «help.txt», |help.txt|. Puede acceder a él a través de Vim con la tecla <Ayuda> o <F1> y con la orden |:help| (sólo teclee «:help», sin las comillas o barras). La opción 'helpfile' se puede configurar con el nombre del archivo de ayuda en caso de no encontrarse en la ubicación habitual. Puede saltar de un tema a otro como si fuesen etiquetas: Use CTRL-] para pasar al tema bajo el cursor, y CTRL-T para volver.

source: Throughout this manual the differences between Vi and Vim are mentioned in curly braces, like this: {Vi does not have on-line help}. See |vi_diff.txt| for a summary of the differences between Vim and Vi.
es_es: Las diferencias entre Vi y Vim se señalarán con llaves, por ejemplo: {Vi no tiene ayuda en línea}. Consulte |vi_diff.txt| para un resumen de las diferencias entre Vim y Vi.

source: This manual refers to Vim on various machines. There may be small differences between different computers and terminals. Besides the remarks given in this document, there is a separate document for each supported system, see |sys-file-list|.
es_es: Este manual trata el uso de Vim en varios sistemas. Pueden existir pequeñas diferencias entre computadoras y terminales. Además de los comentarios que se ofrecen en este documento, hay un documento aparte para cada sistema compatible, consulte |sys-file-list|.

source: *pronounce* Vim is pronounced as one word, like Jim, not vi-ai-em. It's written with a capital, since it's a name, again like Jim.
es_es: *pronounce* *pronunciar* Vim se pronuncia como una sola palabra, como Jim, no uve-a-eme. Se escribe mayúscula, ya que es un nombre al igual que Jim.

source: This manual is a reference for all the Vim commands and options. This is not an introduction to the use of Vi or Vim, it gets a bit complicated here and there. For beginners, there is a hands-on |tutor|. To learn using Vim, read the user manual |usr_toc.txt|.
es_es: Este manual es una referencia para todas las órdenes y opciones de Vim. No es una introducción al uso de Vi o Vim, y algunas secciones son complejas. Hay un tutor práctico, |tutor|. Si quiere aprender a usar Vim, consulte el manual de usuario |usr_toc.txt|.

source: *book* There are many books on Vi that contain a section for beginners. There are two books I can recommend:
es_es: *book* Existen muchos libros sobre Vi que contienen una sección para principiantes. Personalmente recomiendo dos libros:

source: "Vim - Vi Improved" by Steve Oualline
es_es: «Vim - Vi Improved» por Steve Oualline

source: This is the very first book completely dedicated to Vim. It is very good for beginners. The most often used commands are explained with pictures and examples. The less often used commands are also explained, the more advanced features are summarized. There is a comprehensive index and a quick reference. Parts of this book have been included in the user manual |frombook|. Published by New Riders Publishing. ISBN: 0735710015 For more information try one of these: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html
es_es: Este es el primer libro completamente dedicado a Vim. Es muy bueno para principiantes. Las órdenes más usadas se explican con imágenes y ejemplos. También se tratan aquellas órdenes menos comunes, y las características más avanzadas son resumidas. Tiene un completo índice y una rápida referencia. Hay partes de este libro incluidas en el manual de usuario |frombook|. Publicado por New Riders Publishing. ISBN: 0735710015 Pruebe estos enlaces para más información: http://iccf-holland.org/click5.html http://www.vim.org/iccf/click5.html

source: "Learning the Vi editor" by Linda Lamb and Arnold Robbins
es_es: «Learning the Vi editor» por Linda Lamb y Arnold Robbins

source: 2. Vim on the internet *internet*
es_es: 2. Vim en internet *internet*

source: *www* *WWW* *faq* *FAQ* *distribution* *download* The Vim pages contain the most recent information about Vim. They also contain links to the most recent version of Vim. The FAQ is a list of Frequently Asked Questions. Read this if you have problems.
es_es: *www* *WWW* *faq* *FAQ* *distribution* *download* *descargar* Las páginas de Vim ofrecen la información más actualizada. También contienen enlaces a la versión más reciente de Vim. El FAQ es una lista de las preguntas más frecuentes. Consulte esa página en caso de tener problemas.

source: VIM home page: http://www.vim.org/ VIM FAQ: http://vimdoc.sf.net/ Downloading: ftp://ftp.vim.org/pub/vim/MIRRORS
es_es: Página web de VIM http://www.vim.org/ VIM FAQ: http://vimdoc.sf.net/ Descargar: ftp://ftp.vim.org/pub/vim/MIRRORS

source: Usenet News group where Vim is discussed: *news* *usenet* comp.editors This group is also for other editors. If you write about Vim, don't forget to mention that.
es_es: Grupo de Usenet News en el que se trata Vim: *news* *usenet* comp.editors Este grupo también trata de otros editores. Si escribe sobre Vim, no olvide de mencionar esto último.

source: *mail-list* *maillist* There are several mailing lists for Vim: <vim@vim.org> For discussions about using existing versions of Vim: Useful mappings, questions, answers, where to get a specific version, etc. There are quite a few people watching this list and answering questions, also for beginners. Don't hesitate to ask your question here. <vim-dev@vim.org> *vim-dev* *vimdev* For discussions about changing Vim: New features, porting, patches, beta-test versions, etc. <vim-announce@vim.org> *vim-announce* Announcements about new versions of Vim; also for beta-test versions and ports to different systems. This is a read-only list. <vim-multibyte@vim.org> *vim-multibyte* For discussions about using and improving the multi-byte aspects of Vim. <vim-mac@vim.org> *vim-mac* For discussions about using and improving the Macintosh version of Vim.
es_es: *mail-list* *maillist* Existen varias listas de correo acerca de Vim: <vim@vim.org> Para discusiones acerca del uso de varias versiones de Vim: Macros útiles, preguntas, respuestas, dónde obtener una versión especifica. Hay varias personas mirando esta lista, y que responden a preguntas, también para principiantes. No dude en preguntar. <vim-dev@vim.org> *vim-dev* *vimdev* Para la discusión de cambios en Vim: Nuevas características, portabilidad, parches, versiones beta, etc. <vim-announce@vim.org> *vim-announce* Anuncios acerca de nuevas versiones de Vim; también para versiones beta y la adaptación a otras arquitecturas. Lista de sólo lectura. <vim-multibyte@vim.org> *vim-multibyte* Discusión acerca de la mejora de la experiencia multi-byte en Vim. <vim-mac@vim.org> *vim-mac* Discusión acerca del uso y la mejora de la versión Macintosh de Vim.

source: NOTE: - You can only send messages to these lists if you have subscribed! - You need to send the messages from the same location as where you subscribed from (to avoid spam mail). - Maximum message size is 40000 characters.
es_es: NOTA: - Sólo puede mandar mensajes a estas listas si esta suscrito. - Debe mandar los mensajes desde la misma dirección desde la cual se suscribió (para evitar el spam). - El tamaño máximo de un mensaje es de 40000 caracteres.

source: *subscribe-maillist* If you want to join, send a message to <vim-subscribe@vim.org> Make sure that your "From:" address is correct. Then the list server will give you help on how to subscribe.
es_es: *lista-correo* *subscribe-maillist* Si desea unirse, envie un mensaje a <vim-subscribe@vim.org> Asegúrese de que su dirección «De:» es correcta. El servidor de la lista le asistirá para suscribirse.

source: *maillist-archive* For more information and archives look on the Vim maillist page: http://www.vim.org/maillist.php
es_es: *maillist-archive* Para más información y visitar los archivos, visite la página de listas de correo de Vim: http://www.vim.org/maillist.php

source: Bug reports: *bugs* *bug-reports* *bugreport.vim*
es_es: Informes de fallo: *fallos* *informe-de-fallo* *bugs* *bug-reports* *bugreport.vim*

source: It will help to include information about the version of Vim you are using and your setup. You can get the information with this command: > :so $VIMRUNTIME/bugreport.vim This will create a file "bugreport.txt" in the current directory, with a lot of information of your environment. Before sending this out, check if it doesn't contain any confidential information!
es_es: Nos ayudaría si incluye información acerca de su configuración y versión de Vim. Puede obtener esta información con la siguiente orden: > :so $VIMRUNTIME/bugreport.vim Esto creará el archivo «bugreport.txt» en el directorio presente, conteniendo información relativa a su entorno. Antes de enviarlo, revise que no contenga ninguna información confidencial.

source: If Vim crashes, please try to find out where. You can find help on this here: |debug.txt|.
es_es: Si Vim se cuelga, intente encontrar donde. Puede encontrar ayuda aquí: |debug.txt|.

source: There might be a year 2038 problem, when the seconds don't fit in a 32 bit int anymore. This depends on the compiler, libraries and operating system. Specifically, time_t and the ctime() function are used. And the time_t is stored in four bytes in the swap file. But that's only used for printing a file date/time for recovery, it will never affect normal editing.
es_es: Puede aparecer un problema en el año 2038, cuando los segundos no quepan en 32 bits. Esto depende del compilador, la bibliotecas y el sistema operativo. Se usan particularmente las funciones «time_t» y «ctime()». «time_t» se guarda en cuatro bytes en el archivo de intercambio. Esto último sólo se emplea para imprimir una fecha/tiempo para la recuperación y en ningún caso afectará a la edición normal.

source: The Vim strftime() function directly uses the strftime() system function. localtime() uses the time() system function. getftime() uses the time returned by the stat() system function. If your system libraries are year 2000 compliant, Vim is too.
es_es: La función de Vim «strftime()» usa directamente la función del sistema «strftime()». «localtime()» usa la función del sistema «time()». «getftime» usa el tiempo devuelto por la función del sistema «stat()». Si las bibliotecas de sus sistema son compatibles con el año 2000, Vim también lo es.

source: The user may create scripts for Vim that use external commands. These might introduce Y2K problems, but those are not really part of Vim itself.
es_es: El usuario puede crear scripts para Vim que usan órdenes externas. Esto puede introducir problemas Y2K, pero no son parte de Vim.

source: 3. Credits *credits* *author* *Bram* *Moolenaar*
es_es: 3. Creditos *credits* *créditos* *autor* *Bram* *Moolenaar*

source: Parts of the documentation come from several Vi manuals, written by: W.N. Joy Alan P.W. Hewett Mark Horton
es_es: El origen de algunas partes de la documentación nacen de varios manuales de Vim, escritos por: W.N. Joy Alan P.W. Hewett Mark Horton

source: The Vim editor is based on Stevie and includes (ideas from) other software, worked on by the people mentioned here. Other people helped by sending me patches, suggestions and giving feedback about what is good and bad in Vim.
es_es: El editor Vim está basado en Stevie, e incluye ideas procedentes de otro software, trabajadas por la gente aquí mencionada. Otra gente me ayudó mediante parches, sugerencias y opiniones acerca de lo bueno y malo de Vim.

source: I wish to thank all the people that sent me bug reports and suggestions. The list is too long to mention them all here. Vim would not be the same without the ideas from all these people: They keep Vim alive!
es_es: Quisiera dar gracias a toda la gente que envió informes de fallo y sugerencias. La lista es demasiado larga como para mencionarlos a todos aquí. Vim no sería lo mismo sin las ideas de todas esta gente: ¡Mantienen Vim vivo!

source: In this documentation there are several references to other versions of Vi: *Vi* *vi* Vi "the original". Without further remarks this is the version of Vi that appeared in Sun OS 4.x. ":version" returns "Version 3.7, 6/7/85". Sometimes other versions are referred to. Only runs under Unix. Source code only available with a license. More information on Vi can be found through: http://vi-editor.org [doesn't currently work...] *Posix* Posix From the IEEE standard 1003.2, Part 2: Shell and utilities. Generally known as "Posix". This is a textual description of how Vi is supposed to work. See |posix-compliance|. *Nvi* Nvi The "New" Vi. The version of Vi that comes with BSD 4.4 and FreeBSD. Very good compatibility with the original Vi, with a few extensions. The version used is 1.79. ":version" returns "Version 1.79 (10/23/96)". There has been no release the last few years, although there is a development version 1.81. Source code is freely available. *Elvis* Elvis Another Vi clone, made by Steve Kirkendall. Very compact but isn't as flexible as Vim. The version used is 2.1. It is still being developed. Source code is freely available.
es_es: A lo largo de la documentación verá varias referencias a otras versiones de Vi: *Vi* *vi* Vi «El original». Sin mas detalle, esta es la versión de Vim que apareció en Sun Os 4.x. «:version» devuelve «Version 3.7, 6/7/85». A veces encontrara referencias a otras versiones. Sólo funciona bajo Unix. El código sólo está disponible a través de una licencia. Puede encontrar más información a cerca de Vi: http://vi-editor.org (no funciona a día de hoy...) *Posix* Posix Pertenece al estándar IEEE 1003.2. Parte 2: Consola y utilidades. Generalmente conocido como «Posix», una descripción textual de cómo debe funcionar Vi. Véase |posix-compliance|. *Nvi* Nvi El «Nuevo» Vi. La versión de Vi que ofrece BSD 4.4 y FreeBSD. Es muy compatible con el editor original Vi, con unas cuantas extensiones. La versión referida es 1.79. «:version» devuelve «Version 1.79 (10/23/96). No se ha publicado una nueva versión en los últimos años, aunque existe una versión en desarrollo 1.81. El código se distribuye libremente. *Elvis* Elvis Otro clon de Vi, hecho por Steve Kirkendall. Muy compacto pero menos flexible que Vim. La versión referida es 2.1. Aún está en desarrollo. El código se distribuye libremente.

source: 4. Notation *notation*
es_es: 4. Notación *notación* *leyenda*

source: When syntax highlighting is used to read this, text that is not typed literally is often highlighted with the Special group. These are items in [], {} and <>, and CTRL-X.
es_es: Si usa el resaltado de sintaxis para leer esto, el texto que no se ha introducido literalmente será resaltado como perteneciente al grupo Special. Estos son los elementos [], {}, <> y CTRL-X.

source: Note that Vim uses all possible characters in commands. Sometimes the [], {} and <> are part of what you type, the context should make this clear.
es_es: Tenga en cuenta que Vim utiliza todos los caracteres posibles en las órdenes. El contexto aclarará cuando los signos [], () y <> son parte de texto literal.

source: [] Characters in square brackets are optional.
es_es: [] Los caracteres entre corchetes son opcionales.

source: *count* *[count]* *E489* [count] An optional number that may precede the command to multiply or iterate the command. If no number is given, a count of one is used, unless otherwise noted. Note that in this manual the [count] is not mentioned in the description of the command, but only in the explanation. This was done to make the commands easier to look up. If the 'showcmd' option is on, the (partially) entered count is shown at the bottom of the window. You can use <Del> to erase the last digit (|N<Del>|).
es_es: *[número]* *[count]* *E489* Un número opcional que puede preceder a la orden para multiplicar o cambiar la orden. Si no introduce un número, se usará uno a menos que se indique lo contrario. Tenga en cuenta] que en este manual, el [número no se menciona en las descripciones de las órdenes. La razón para esto es facilitar la lectura de las órdenes. Si la opción esta activada, el número (parcialmente) introducido se mostrará en la parte inferior de la ventana. Puede usar <Supr> para eliminar el último dígito (|N<Supr>|).

source: *[quotex]* ["x] An optional register designation where text can be stored. See |registers|. The x is a single character between 'a' and 'z' or 'A' and 'Z' or '"', and in some cases (with the put command) between '0' and '9', '%', '#', or others. The uppercase and lowercase letter designate the same register, but the lowercase letter is used to overwrite the previous register contents, while the uppercase letter is used to append to the previous register contents. Without the ""x" or with """" the stored text is put into the unnamed register.
es_es: *quotex* ["x] Un destino opcional para un registro dónde guardar el texto. Consulte |registers|. La x es un único carácter entre 'a' y 'z', o 'A' y 'Z' o '"', y en algunos casos (con la orden «put») entre '0' y '9', '%', '#', u otros. Las mayúsculas y y minúsculas designan el mismo registro, pero la minúscula se usa para eliminar los contenidos anteriores del registro, y la mayúscula para añadir contenido. El texto se almacenará en un registro sin nombre en caso de no usar «"x» o «""».

source: *{}* {} Curly braces denote parts of the command which must appear, but which can take a number of different values. The differences between Vim and Vi are also given in curly braces (this will be clear from the context).
es_es: *{}* {} Las llaves indican qué partes de una orden son obligatorios, pero que pueden tomar distintos valores. Las diferencias entre Vim y Vi también se resaltan con llaves (el contexto aclarará esto).

source: *{char1-char2}* {char1-char2} A single character from the range char1 to char2. For example: {a-z} is a lowercase letter. Multiple ranges may be concatenated. For example, {a-zA-Z0-9} is any alphanumeric character.
es_es: *{car1-car2}* {car1-car2} Un único carácter entre el rango car1 y car2. Por ejemplo: {a-z} simboliza un carácter en minúscula. Puede encadenar varios rangos. Por ejemplo, {a,zA-Z0-9} es cualquier carácter alfanumérico.

source: *<character>* <character> A special character from the table below, optionally with modifiers, or a single ASCII character with modifiers.
es_es: *<carácter>* *<character>* <carácter> Un carácter especial de la tabla a continuación, que acepta modificadores opciones, o un único carácter ASCII sin modificadores.

source: *'character'* 'c' A single ASCII character.
es_es: *'character'* 'c' Un único carácter ASCII.

source: *'option'* 'option' An option, or parameter, that can be set to a value, is enclosed in single quotes. See |options|.
es_es: *'option'* 'opción' Una opción o parámetro que puede definir con un valor aparecerá entre comillas simples. Consulte |options|.

source: *quotecommandquote* "command" A reference to a command that you can type is enclosed in double quotes.
es_es: *quotecommandquote* "orden" Las referencias a una orden aparecerán entre comillas dobles.

source: *key-notation* *key-codes* *keycodes* These names for keys are used in the documentation. They can also be used with the ":map" command (insert the key name by pressing CTRL-K and then the key you want the name for).
es_es: *notación-teclas* *teclas-tabla* *leyendatabla* Éstos son los nombres de las teclas en la documentación. También puede usarlos con la orden «:map» (inserte el nombre de la tecla pulsando CTRL-K y la tecla cuyo nombre desea).

source: notation meaning equivalent decimal value(s) ~ -----------------------------------------------------------------------
es_es: notación significado equivalente valor(es) decimal ~ -----------------------------------------------------------------------

source: <Nul> zero CTRL-@ 0 (stored as 10) *<Nul>* <BS> backspace CTRL-H 8 *backspace* <Tab> tab CTRL-I 9 *tab* *Tab* *linefeed* <NL> linefeed CTRL-J 10 (used for <Nul>) <FF> formfeed CTRL-L 12 *formfeed* <CR> carriage return CTRL-M 13 *carriage-return* <Return> same as <CR> *<Return>* <Enter> same as <CR> *<Enter>* <Esc> escape CTRL-[ 27 *escape* *<Esc>* <Space> space 32 *space* <lt> less-than < 60 *<lt>* <Bslash> backslash \ 92 *backslash* *<Bslash>* <Bar> vertical bar | 124 *<Bar>* <Del> delete 127 <CSI> command sequence intro ALT-Esc 155 *<CSI>* <xCSI> CSI when typed in the GUI *<xCSI>*
es_es: <Nul> cero CTRL-@ 0 (stored as 10) *<Nul>* <BS> tecla de retroceso CTRL-H 8 *backspace* <Tab> tabulado CTRL-I 9 *tab* *Tab* *linefeed* <NL> avanzar una línea CTRL-J 10 (usado por <Nul>) <FF> formfeed CTRL-L 12 *formfeed* <CR> retorno de línea CTRL-M 13 *carriage-return* <Return> idéntico a <CR> *<Return>* <Enter> idéntico a <CR> *<Enter>* <Esc> escape CTRL-[ 27 *escape* *<Esc>* <Space> espacio 32 *space* <lt> menos que < 60 *<lt>* <Bslash> barra inversa \ 92 *backslash* *<Bslash>* <Bar> barra vertical | 124 *<Bar>* <Del> eliminar 127 <CSI> command sequence intro ALT-Esc 155 *<CSI>* <xCSI> CSI tecleado en la interfaz gráfica *<xCSI>*

source: <EOL> end-of-line (can be <CR>, <LF> or <CR><LF>, depends on system and 'fileformat') *<EOL>*
es_es: <EOL> «end-of-line» (fin de línea, puede ser <CR>, <LF> o <CR><LF>, dependiendo del sistema y de 'fileformat') <EOL>

source: Note: The shifted cursor keys, the help key, and the undo key are only available on a few terminals. On the Amiga, shifted function key 10 produces a code (CSI) that is also used by key sequences. It will be recognized only after typing another key.
es_es: Nota: Las teclas de movimiento, la tecla de ayuda y la tecla deshacer combinados con la tecla shift sólo están disponibles en algunas terminales. En Amiga, la tecla función 10 con shift produce un código (CSI) también empleado en secuencias de teclas. Sólo se reconocerá tras pulsar otra tecla.
